<template>
  <div class="about">
    <!-- <div class="about__header" /> -->
    <div class="about__container">
      <p class="about__desc">
        907은 매주 새로운 리더보드를 생성합니다.
        리더보드는 선수의 스탯이 아니라 한 주의 유저 반응에 의해서만 만들어집니다.
        ( 조회수 + 총 투표수 + 댓글 수 )
        수치상으로 뛰어난 선수가 아니라, 팬들에게 가장 많은 관심을 받은 선수가 누구인지.
        누가 가장 '핫'한지 알고 함께 이야기 나누는 것이 컨셉이기 때문입니다.
        해트트릭을 한 선수, 엉망이었던 선수, 가장 웃겼던 선수 누구나 리더보드 최상위에
        위치할 수 있습니다.
        리더보드는 매주 금요일 18시(UTC)에 초기화되며 초기화 후 6시간 동안
        새로운 리더보드를 준비합니다. (Preseason)
        프리시즌 기간동안 유저들은 원하는 선수를 검색해 의견을 남길 수 있습니다.
        프리시즌을 갖는 이유는 리셋 후 소수의 의견에 의해 순위가 결정되는 것을
        방지하기 위해서입니다.
      </p>
    </div> 

    <div class="about__container">
      <p class="about__desc">
        가장 많은 관심을 받은 선수가 907도로 설정되고,
        이 선수를 기준으로 다른 선수들의 온도가 정해집니다.
        카드의 우측 상단에 위치한 숫자가 바로 그것입니다.
        만약 두번째 선수의 온도가 300도라면 최상위 선수가 독보적인 관심을 받는 것입니다.
      </p>
    </div>

    <div class="about__container">
      <p class="about__desc">
        히스토리가 궁금하다면 헤더의 타임라인 아이콘을 클릭해보세요.
        각 주의 리더보드와 댓글을 확인 할 수 있습니다.
      </p>
    </div>

    <div class="about__container">
      <p class="about__desc">
        현재 20-21시즌 EPL에 소속된 선수만 있지만, 점점 폭을 늘려나갈 계획입니다.
        최신 리더보드를 확인하고, 의견을 남겨보세요!
      </p>
    </div>

    <div class="about__container">
      <p class="about__desc">
        [커뮤니티 가이드]
        * 기본적으로 모든 유저들에게는 표현의 자유가 있으며, 이를 다른 유저가 침해해서는 안됩니다.
        * 우리는 유저들에게 가능한 많은 자유를 보장하고 싶습니다.

        * 그러나 최소한의 가이드가 없다면 커뮤니티와 선량한 유저들이 피해를 입게 될 수 있습니다.
        * 선수나 다른 유저에 대한 심한 모욕이나 악의적 공격은 경고 없이 삭제될 수 있습니다.
        * 또한 위와 같은 행위가 반복되는 계정에 대해서는 경고 없이 제제를 가할 수 있습니다.
        * 인종이나 민족, 국적, 종교, 장애, 성별, 연령에 따라 개인이나 그룹에 대한 폭력을
        선동하거나 용납하는 의견 또는 이러한 핵심 특성을 기준으로 증오를 조장하는
        의견을 강력하게 금지합니다.
      </p>
    </div>
  </div>
</template>

<script>
export default {
  layout: 'wide',
  transition: 'fade'
};
</script>

<style lang="scss" scoped>
@import "@/page-resources/about/_style.scss";
</style>